In [1]:
## Jorge Castro

pwd

'C:\\Users\\jcast'

In [43]:
import pandas as pd

Read the three files into python as dataframes

In [44]:
# This is to read the files into pandas as dataframe
file1 = pd.read_csv('file1.csv')
file2 = pd.read_csv('file2.csv')
file3 = pd.read_csv('file3.csv')

Show the DataFrame's shape.

In [45]:
# The shape command is to see the structure of the dataframe, in this case we 
# have 4008 rows and 11 columns 
file1.shape

(4008, 11)

Standardize header names.

In [46]:
# Using the iloc method to show only 1 row to compare the 3 dataframes easier 
file1.iloc[:1]

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934

In [47]:
file2.iloc[:1]

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car

In [48]:
file3.iloc[:1]

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.2,Two-Door Car

In [49]:
# Standardize header names we use the rename method and specify axis 1 as it is a column

file1 = file1.rename({'ST': 'State', 'GENDER': 'Gender'}, axis=1)

In [50]:
file2 = file2.rename({'ST': 'State', 'GENDER': 'Gender'}, axis=1)

Rearrange the columns in the dataframe as needed

In [51]:
# Rearrange the columns in the dataframe as needed. I will reorder file2 and file 3 
# with the same format as file1

file2 = file2[['Customer', 'State', 'Gender', 'Education', 'Customer Lifetime Value', 'Income', 'Monthly Premium Auto', 'Number of Open Complaints', 'Policy Type', 'Vehicle Class', 'Total Claim Amount']]

In [52]:
file3 = file3[['Customer', 'State', 'Gender', 'Education', 'Customer Lifetime Value', 'Income', 'Monthly Premium Auto', 'Number of Open Complaints', 'Policy Type', 'Vehicle Class', 'Total Claim Amount']]

Concatenate the three dataframes

In [53]:
# Concatenate the three dataframes with the Concat method, as all the columns are the 
# same we join the df by the axis 0 which is rows

data = pd.concat([file1, file2, file3], axis = 0)

In [54]:
## Now we see how the new dataFrame looks like only showing the 1st row
data.iloc[:1]

,Customer,State,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934

In [55]:
## to see if the structure or the shape of the 
# new df is what we want, we call the df with the shape method, in own case we should have 
data.shape

(12074, 11)

In [56]:
## Which columns are numerical?

# Income
# Monthly Premium Auto 
# Total Claim Amount

## To see individual columns data type we use Type method

type(data.columns[0])

str

In [57]:
## With the dtypes method we can see all the data types of each column

data.dtypes

Customer                      object
State                         object
Gender                        object
Education                     object
Customer Lifetime Value       object
Income                       float64
Monthly Premium Auto         float64
Number of Open Complaints     object
Policy Type                   object
Vehicle Class                 object
Total Claim Amount           float64
dtype: object

In [58]:
# Which columns are categorical?


# Understand the meaning of all columns

# Perform the data cleaning operations mentioned so far in class

Delete the column education and the number of open complaints from the dataframe.
(we use the Drop method specifying the axis)

In [60]:


data = data.drop('Education', 1)

In [61]:
data.iloc[:1]

,Customer,State,Gender,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934

In [62]:
data = data.drop('Number of Open Complaints', 1)

In [63]:
data.head()

,Customer,State,Gender,Customer Lifetime Value,Income,Monthly Premium Auto,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59%,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,1288743.17%,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,764586.18%,0.0,106.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,536307.65%,36357.0,68.0,Personal Auto,Four-Door Car,17.269323

Correct the values in the column customer lifetime value. They are given as a percent, so multiply them by 100 and change dtype to numerical type.

In [64]:
data['Customer Lifetime Value'].dtypes

dtype('O')

In [65]:
# With the info method we can have an overview of all the data types
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12074 entries, 0 to 7069
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Customer                 9137 non-null   object
 1   State                    9137 non-null   object
 2   Gender                   9015 non-null   object
 3   Customer Lifetime Value  9130 non-null   object
 4   Income                   9137 non-null   float64
 5   Monthly Premium Auto     9137 non-null   float64
 6   Policy Type              9137 non-null   object
 7   Vehicle Class            9137 non-null   object
 8   Total Claim Amount       9137 non-null   float64
dtypes: float64(3), object(6)
memory usage: 943.3+ KB

In [66]:
# In order to change the data type of the column from str to numerical, 
# we need to first delete the % symbols from the valuesand replace it with an empty space. 
# We use the replace method for this. 

data['Customer Lifetime Value'] = data['Customer Lifetime Value'].str.replace('%','')

In [67]:
data.head()

,Customer,State,Gender,Customer Lifetime Value,Income,Monthly Premium Auto,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,1288743.17,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,764586.18,0.0,106.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,536307.65,36357.0,68.0,Personal Auto,Four-Door Car,17.269323

In [68]:
# Changing the data type of Customer Lifetime Value column from its original 
# object type to float64 which is a numeric data type

data['Customer Lifetime Value'] = pd.to_numeric(data['Customer Lifetime Value']).astype('float64')

In [69]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12074 entries, 0 to 7069
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Customer                 9137 non-null   object
 1   State                    9137 non-null   object
 2   Gender                   9015 non-null   object
 3   Customer Lifetime Value  2060 non-null   float64
 4   Income                   9137 non-null   float64
 5   Monthly Premium Auto     9137 non-null   float64
 6   Policy Type              9137 non-null   object
 7   Vehicle Class            9137 non-null   object
 8   Total Claim Amount       9137 non-null   float64
dtypes: float64(4), object(5)
memory usage: 943.3+ KB

Check for duplicate rows in the data and remove if any.

In [90]:
# This method has a default argument for a parameter called "keep"
# This method is marking duplicates as True except for the first 
# occurence or the first original row (in this case each row is one customer)
# customer. So its keeping one row and 
# only showing us the duplicates.

data[data.duplicated()]

,Customer,State,Gender,Customer Lifetime Value,Income,Monthly Premium Auto,Policy Type,Vehicle Class,Total Claim Amount
1072,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1073,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1074,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1075,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1076,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
2,MY31220,California,F,899704.02,54230.0,112.0,Personal Auto,Two-Door Car,537.600000
998,TO60700,Washington,F,NaN,25859.0,74.0,Special Auto,Four-Door Car,355.200000
1471,RI52095,Washington,M,NaN,51878.0,66.0,Personal Auto,Four-Door Car,316.800000
1487,MW80236,Washington,M,NaN,0.0,70.0,Personal Auto,Four-Door Car,336.000000
1535,SP81997,Washington,F,NaN,41275.0,96.0,Personal Auto,Four-Door Car,41.122303

In [78]:
# We can count all the duplicates rows or customers:
data.duplicated().sum()

2943

In [88]:
# Filter out the data for customers who have an income of 0 or less.
# In order to see a more readeble result we save the filter to a variable


filter_income_cero = (data['Income'] <= 0)

In [89]:
# data for customers who have an income of 0 or less.

data[filter_income_cero]

,Customer,State,Gender,Customer Lifetime Value,Income,Monthly Premium Auto,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
3,WW63253,California,M,764586.18,0.0,106.0,Corporate Auto,SUV,529.881344
7,CF85061,Arizona,M,721610.03,0.0,101.0,Corporate Auto,Four-Door Car,363.029680
10,SX51350,California,M,473899.20,0.0,67.0,Personal Auto,Four-Door Car,482.400000
...,...,...,...,...,...,...,...,...,...
7059,WZ45103,California,F,NaN,0.0,76.0,Personal Auto,Four-Door Car,364.800000
7061,RX91025,California,M,NaN,0.0,185.0,Personal Auto,SUV,1950.725547
7062,AC13887,California,M,NaN,0.0,67.0,Corporate Auto,Two-Door Car,482.400000
7067,TD14365,California,M,NaN,0.0,85.0,Corporate Auto,Four-Door Car,790.784983
7069,Y167826,California,M,NaN,0.0,77.0,Corporate Auto,Two-Door Car,369.600000